const randomAvatar = {
  min: 1,
  max: 6,
};

const randomAmountLikes = {
  min: 15,
  max: 200,
};

const randomNumberComments = {
  min: 5,
  max: 150,
};

const randomNumberID = {
  min: 1,
  max: 10,
};

const NAME = [
  'Григорий',
  'Виктор',
  'Павел',
  'Алексей',
  'Кирилл'
];

const MESSAGES = [
  'Всё отлично!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!'
];

const DESCRIPTIONS = [
  'Фото',
  'Природа Урала',
  'Кавказские горы',
  'Моя квартира'
];

export {
  randomAvatar,
  randomAmountLikes,
  randomNumberComments,
  randomNumberID,
  DESCRIPTIONS,
  NAME,
  MESSAGES,
};
